import React from "react";
import "./footer.css";

const Footer = () => {
  return (
    <footer className="footer">
      <div className="footer-top-box">
        <h2 className="get-news-title">عضویت در خبرنامه</h2>

        <input
          type="email"
          placeholder="عضویت در خبرنامه | ایمیل خود را وارد کنید ..."
        />
        <button>عضویت</button>
      </div>

      <div className="main-footer">
        <div className="footer-about-us">
          <div className="about-us-content">
            <h2>کتاب فروشی و کتابخانه تیسفون</h2>
            <p>
              لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با
              استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله
              در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
              نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد،
              کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان
              جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای
              طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان
              فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری
              موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد
              نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل
              دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.
            </p>
          </div>
          <div className="social-media-links"></div>
        </div>
        <div className="footer-links">
          <ul>
            <h3>صفحات مهم</h3>
            <li>صفحه اصلی</li>
            <li>وبلاگ</li>
            <li>رویدادها</li>
            <li>تماس با ما</li>
            <li>درباره ما</li>
          </ul>
          <ul>
            <h3>رویدادهای مهم</h3>
            <li>جشنواره تابستانی</li>
            <li>کتابخوانی 1402</li>
            <li>نمایشگاه کتاب</li>
            <li>نویسندگی حرفه ای</li>
            <li>همایش نویسنده برتر</li>
          </ul>
          <ul>
            <h3>مدیران مجموعه</h3>
            <li>مدیر مالی</li>
            <li>مدیر اجرایی</li>
            <li>مدیر منابع انسانی</li>
            <li>نمایندگی ها</li>
            <li>روابط عمومی</li>
          </ul>
          <ul>
            <h3>شعب برتر</h3>
            <li>ملاصدرا</li>
            <li>عظیمیه</li>
            <li>طالقانی</li>
            <li>میدان ونک</li>
            <li>شمیرانات</li>
          </ul>
        </div>
      </div>
    </footer>
  );
};

export default Footer;
